Tekla.Structures.Plugins.PluginBase.InputDefinition.InputTypeEnum
The possible input types for a plug-in.

Tekla.Structures.Plugins.PluginBase.InputDefinition.InputTypeEnum.INPUT_ONE_POINT
The input is one point (x,y,z).

Tekla.Structures.Plugins.PluginBase.InputDefinition.InputTypeEnum.INPUT_TWO_POINTS
The input is two points.

Tekla.Structures.Plugins.PluginBase.InputDefinition.InputTypeEnum.INPUT_POLYGON
The input is multiple points.

Tekla.Structures.Plugins.PluginBase.InputDefinition.InputTypeEnum.INPUT_ONE_OBJECT
The input is one ID of any type.

Tekla.Structures.Plugins.PluginBase.InputDefinition.InputTypeEnum.INPUT_N_OBJECTS
The input is N IDs of any type.